Aristo233/MK66F18_Ref9a.c/MK66F18_Ref9a.c
void MotorCtrlOL(uint8_t SpeedCmd)
{
	if(SpeedCmd>100)
		return;

	FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_3, kFTM_EdgeAlignedPwm, SpeedCmd);
	FTM_SetSoftwareTrigger(FTM0_PERIPHERAL, true);
}

// Closed-loop speed control
// feedback available on MotorSpeedFdbk1
void MotorCtrlCL(void)
{
	uint16_t CtrlValue=0;

	CtrlValue = MotorSpeedCal/10;		// MotorSpeedCal updated in PIT IRQ at an interval of 5ms
	if (CtrlValue > 15)
		CtrlValue = 15;

	//FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_3, kFTM_EdgeAlignedPwm, SpeedCmd);
	FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_3, kFTM_EdgeAlignedPwm, CtrlValue);
	FTM_SetSoftwareTrigger(FTM0_PERIPHERAL, true);


}

// Your code here to find the target tracking point
// Result: update TrackIndex value
void FindTrackPoint(void)
{
	int16_t DMax, DMin, DV;
	uint8_t MaxIndex, MinIndex;
	uint16_t i;

	DMax = 0;
	DMin = 0;
	for (i=0; i<126; i++)
	{
		DV = CCDData[i+2] - CCDData[i];
		if (DV > DMax)		// Raising edge
		{
			DMax = DV;
			MaxIndex = i+1;
		}
		if (DV < DMin)		// Falling edge
		{
			DMin = DV;
			MinIndex = i+1;
		}
	}
	TrackIndex = (MaxIndex+MinIndex)/2;
}

/*
 * @brief   Application entry point.
 */
int main(void) {
																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																																														uint8_t TaskID = 0;		// loop switch
    uint32_t LastSecond=0;
    //uint16_t ServoDutyCounter=0;
    //bool ServoDutyCountDir=1;		// 0: count down; 1: count up
	uint32_t tempInt = 0;
	uint16_t CCDMin = 0;
	uint8_t index = 0;
	uint8_t CCD2PC[260];	// data to be sent to PC

	char OLEDLine1[] = "0123456789abcdef";
	char OLEDLine2[] = "0123456789abcdef";
	char OLEDLine3[] = "0123456789abcdef";
	char OLEDLine4[] = "0123456789abcdef";

    /* Init board hardware. */
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitBootPeripherals();

    BOARD_InitI2C();
    OLED_Init();

    KC4D();		// Welcome message
    // Header of CCD data frame, seekfree protocol
    CCD2PC[0] = 0x00;
	CCD2PC[1] = 0xFF;
	CCD2PC[2] = 0x01;
	CCD2PC[3] = 0x00;


#ifndef BOARD_INIT_DEBUG_CONSOLE_PERIPHERAL
    /* Init FSL debug console. */
    BOARD_InitDebugConsole();
#endif

	TaskID = (~((SW1()<<3) + (SW2()<<2) + (SW3()<<1) + SW4())) & 0x0F;
    PRINTF("Task ID: %d\r\n", TaskID);

    LastSecond = ElapsedSeconds;
    LED1_ON();    LED2_OFF();

    volatile static int i = 0 ;
    //ServoDutyCountDir = 1;	// count up
    //ServoDutyCounter = 500;	// Lower Limit

	if (TaskID == 1U)		// Test RC/Servo
	{
		QESVar = ServoDC1ref;
		ServoDC1 = ServoDC1ref;
		ServoDC2 = ServoDC2ref;
	}
    if (TaskID == 7U)		// using MT9V034?
		MT9V034_Init(50);
	if ((TaskID == 4U) || (TaskID == 9U))		// Test Motor driver?
	{
		M1_DISABLE();
		M2_DISABLE();
		FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_2, kFTM_EdgeAlignedPwm, 0);
		FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_3, kFTM_EdgeAlignedPwm, 0);
    	FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_4, kFTM_EdgeAlignedPwm, 0);
    	FTM_UpdatePwmDutycycle(FTM0_PERIPHERAL, kFTM_Chnl_7, kFTM_EdgeAlignedPwm, 0);
		M1_ENABLE();
	}

    OLED_Init();

    while(1) {
    	switch (TaskID)
    	{
    	case 1U:		// Tune ServoDC1 to find ServoLimitUpper and ServoLimitLower
        	//delay_short();
    		if (BTN())
    		{
    			//QESVar = ServoDC1ref;
				ServoDC1 = ServoDC1ref;
				ServoDC2 = ServoDC1ref;
    		}
    		if (KEY1())
    		{
    			if (ServoDC1 > 530)
    				ServoDC1 -= 10;
    			while (KEY1()) {}
    		}
    		if (KEY2())
    		{
    			if (ServoDC1 <= 2510)
    				ServoDC1 += 10;
    			while (KEY2()) {}
    		}
    		if (tempInt != ServoDC1)
    		{
    			tempInt = ServoDC1;
    			Update_ServoUS(kFTM_Chnl_0, tempInt);
    			Update_ServoUS(kFTM_Chnl_1, tempInt);
                sprintf (OLEDLine2, "PWM: %04hd", tempInt);
				OLED_P8x16Str(0,2,(uint8_t *)OLEDLine2);
    		}
    		break;
    	case 2U:		// MEMS data acquisition and processing
            CDK66_Analog_Input(&AnalogIn);		// Update all analog inputs
            MemsX = AnalogIn.x;
            MemsY = AnalogIn.y;
            MemsZ = AnalogIn.z;
            //MemsX1 = ((float)MemsX-2048.0)/101.3234;
            //MemsY1 = ((float)MemsY-2048.0)/101.3234;
            //MemsZ1 = ((float)MemsZ-2048.0)/101.3234;
    		break;
    	case 3U:		// MEMS data acquisition and processing
            CDK66_Analog_Input(&AnalogIn);		// Update all analog inputs
            if (KEY1())
            {
                sprintf (OLEDLine2, "x:%04hd  IR1:%04hd", AnalogIn.x, AnalogIn.IRV1);
                sprintf (OLEDLine3, "y:%04hd  IR2:%04hd", AnalogIn.y, AnalogIn.IRV2);
            }
            else
            {
                sprintf (OLEDLine2, "x:%04hd  Mg1:%04hd", AnalogIn.x, AnalogIn.HALL1);
                sprintf (OLEDLine3, "y:%04hd  Mg2:%04hd", AnalogIn.y, AnalogIn.HALL2);
            }
            sprintf (OLEDLine4, "z:%04hd  ct:%04hd", AnalogIn.z, AnalogIn.Temp);
            //sprintf (OLEDLine4, "z:%04hd  ct:%4.1fC", AnalogIn.z, ICTemp);
            OLED_P8x16Str(0,0,(uint8_t *)"## Cyber-K66 ###");
    	    OLED_P8x16Str(0,2,(uint8_t *)OLEDLine2);
    	    OLED_P8x16Str(0,4,(uint8_t *)OLEDLine3);
    	    OLED_P8x16Str(0,6,(uint8_t *)OLEDLine4);
    		break;
    	case 4U:		// TSL1401 Linear CCD acquisition and display
        	//CollectCCD();
        	LinearCameraOneShot();
        	// draw linear CCD 128 pixel on OLED
    		//Draw_LinearView();
    		Draw_LinearViewHalf();
    		if (KEY1())		// Key S1 pressed down?
    		{
    	    	//send 128 points CCD data (128*2byte) to UART0, using seekfree protocol
    			for(tempInt=0; tempInt<128; tempInt++)
    			{
    				CCD2PC[tempInt*2+4] = CCDData[tempInt] >> 8;	// Upper byte
    				CCD2PC[tempInt*2+5] = CCDData[tempInt] & 0XFF;	// Lower byte
    			}
    			UART_WriteBlocking(UART0_PERIPHERAL, CCD2PC, 260U);
    		}
    		//FindTrackPoint();		// your code to find the tracking point
    		CCDMin = 4095;
    		for (tempInt=10; tempInt<120; tempInt++)
    		{
    			if (CCDData[tempInt] < CCDMin)
    			{
    				CCDMin =CCDData[tempInt];
    				index = tempInt;
    			}
    		}

    		for(tempInt=10; tempInt<118; tempInt++)
    		{
    			if(CCDData[tempInt]<400)
    			{
    				pointrow[tempInt-10] = 0;
    				barcounter++;
    			}
    			else
    			{
    				pointrow[tempInt] = 1;
    			}
    		}

