Aristo233/MK66F18_Ref9a.c/MK66F18_Ref9a.c
    		for(tempInt=0; tempInt<108; tempInt++)
    		{
    			if(pointrow[tempInt] == 1&&pointrow[tempInt+1]==0&&pointrow[tempInt+2]==0&&pointrow[tempInt+3]==0)
    			{
    				start = tempInt + 1;
    				JumpCounter ++;
    			}
    			if(pointrow[tempInt] == 1&&pointrow[tempInt-1]==0&&pointrow[tempInt-2]==0&&pointrow[tempInt-3]==0)
    			   {
    			    	end = tempInt - 1;;
    			    	JumpCounter++;
    			    }
    		}

    		if(JumpCounter <3)
    		{
    		index = (end+start)/2;
    		}

    		if(barcounter>=90)
    		{
    			//BEEP_ON();
    			delay();
    			BEEP_OFF();
    			barcounter = 0;
    		}

    		if(JumpCounter>3)
    		{
    			LoopCounter++;

    		}

    		if(LoopCounter == 2)
    		{
    			MotorSpeedCmd1=0;
    		}


    			tempInt = 800 + index*11;


    		JumpCounter = 0;
    		// Substitute with your code
			//tempInt = 1000 + TrackIndex*8;		// Using your own code
    		Update_ServoUS(kFTM_Chnl_0, tempInt);
			Update_ServoUS(kFTM_Chnl_1, tempInt);

    		if (BTN())
    		{
    			MotorSpeedCmd1 = 0;
				MotorSpeedCmd2 = 0;
    		}
    		if (KEY1())
    		{
    			if (MotorSpeedCmd1 >= 5)
    				MotorSpeedCmd1 -= 2;
    			while (KEY1()) {}
    		}
    		if (KEY2())
    		{
    			if (MotorSpeedCmd1 <= 95)
    				MotorSpeedCmd1 += 2;
    			while (KEY2()) {}
    		}
            sprintf (OLEDLine1, "Target: %03hd", start);
            sprintf (OLEDLine2, "SpeedCmd: %03hd", end);
			OLED_P8x16Str(0,0,(uint8_t *)OLEDLine1);
			OLED_P8x16Str(0,2,(uint8_t *)OLEDLine2);
			if(index<75&&index>54)
			MotorCtrlOL(MotorSpeedCmd1);
			else if(index>75||index<54)
				MotorCtrlOL(MotorSpeedCmd1);
			//PIT_CHANNEL_1_IRQHANDLER()// Open-Loop speed control
    		//MotorCtrlCL();		// Closed-Loop speed control
    		LED1_TOGGLE();
    		//printf( MotorSpeedFdbk1);
            break;
    	case 7U:		// MT9V034 image capture and display
        	if (CamDataReady)
        	{
        		Get_Use_Image();		// resize data to fit OLED
        		if (KEY1())				// key S1 pressed down? If yes then use OTSU
        			Get_01_Value(1);	// 1 - OTSU; 0 - average
        		else
        			Get_01_Value(0);	// 1 - OTSU; 0 - average
        		Draw_CameraView();		// display on OLED
        		if (KEY2()) SendImage();	// key S2 pressed down? If yes send ImageData to PC
        		CamDataReady = 0;
        	}
    		break;
    	case 8U:		// RTC: "#cmd01data20230405-180000\r\n"
        	if (ElapsedSeconds != LastSecond)	// ElapsedSeconds increased in RTC_Seconds_IRQn
        	{
        		LED1_TOGGLE();	LED2_TOGGLE();
        		LastSecond = ElapsedSeconds;
        		RTC_GetDatetime(RTC, &appDateTime);
    			sprintf (OLEDLine1, "Date: %04hd-%02hd-%02hd", appDateTime.year, appDateTime.month, appDateTime.day);
    			sprintf (OLEDLine2, "Time: %02hd:%02hd:%02hd", appDateTime.hour, appDateTime.minute, appDateTime.second);
    			OLED_P8x16Str(0,0,(uint8_t *)OLEDLine1);
    			OLED_P8x16Str(0,2,(uint8_t *)OLEDLine2);
        	}
    		break;
    	case 9U:		// Test motor drive
    		//uint8_t MotorSpeedCmd1=0, MotorSpeedCmd2=0;
    		//uint32_t MotorSpeedFdbk1=0, MotorSpeedFdbk2=0;
    		if (BTN())
    		{
    			MotorSpeedCmd1 = 0;
				MotorSpeedCmd2 = 0;
    		}
    		if (KEY1())
    		{
    			if (MotorSpeedCmd1 >= 5)
    				MotorSpeedCmd1 -= 5;
    			while (KEY1()) {}
    		}
    		if (KEY2())
    		{
    			if (MotorSpeedCmd1 <= 95)
    				MotorSpeedCmd1 += 5;
    			while (KEY2()) {}
    		}
            sprintf (OLEDLine2, "SpeedCmd: %03hd", MotorSpeedCmd1);
			OLED_P8x16Str(0,2,(uint8_t *)OLEDLine2);
    		MotorCtrlOL(MotorSpeedCmd1);
    		break;
    	case 15U:
    		break;
    	default:		// HMI basics
    		i++;
    		delay();
            if (KEY1()) LED1_ON();
            else LED1_OFF();
            if (KEY2()) LED2_ON();
            else LED2_OFF();
    		if (BTN()) BEEP_ON();
            else BEEP_OFF();
	        ShowNumDEC(i);
	        BOARD_I2C_GPIO(i);
    		break;
    	}
    }
    return 0 ;
}
